Revit 2027 API
RebarRoundingManager.ApplicableSegmentLengthRounding Property
 The applicable rounding for shared parameters used by rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ApplicableSegmentLengthRounding { get; }
Public ReadOnly Property ApplicableSegmentLengthRounding As Double
	Get
public:
property double ApplicableSegmentLengthRounding {
	double get ();
}
member ApplicableSegmentLengthRounding : float with get
Property Value
Double
Remarks
 IsActiveOnElement property of ReinforcementSettings RebarRoundingManager has to be true. ApplicableSegmentLengthRounding is meaningless if ReinforcementSettings RebarRoundingManager IsActiveOnElement is false.
See Also
Reference
RebarRoundingManager Class
Autodesk.Revit.DB.Structure Namespace